{
    "welcomeMessages": [
        "Welcome to the Text Adventure Game!",
        "Type your commands below and press enter or click submit to interact."
    ],
    "timePeriods": [
        {
            "hour": 8,
            "name": "Sunrise",
            "message": "A soft glow pierces the horizon."
        },
        {
            "hour": 9,
            "name": "Morning",
            "message": "The day brightens as the sun climbs."
        },
        {
            "hour": 12,
            "name": "Noon",
            "message": "The sun reigns overhead, relentless."
        },
        {
            "hour": 15,
            "name": "Late Afternoon",
            "message": "The shadows of objects begin to lengthen."
        },
        {
            "hour": 18,
            "name": "Dusk",
            "message": "The horizon burns with the dying light."
        },
        {
            "hour": 20,
            "name": "Evening",
            "message": "Twilight descends, enveloping the world in soft darkness."
        },
        {
            "hour": 22,
            "name": "Night",
            "message": "The cloak of night covers all in stillness."
        },
        {
            "hour": 4,
            "name": "Before Sunrise",
            "message": "A before-sunrise blue tints the night sky."
        }
    ],
    "awakenessMessages": {
        "9": "You feel the first twinge of tiredness after the day's adventures.",
        "6": "You feel sleepier.",
        "3": "You are definitely tired and feeling the pull of sleepiness.",
        "1": "I hope there is a place for you to lay down your head and sleep.",
        "0": "You can't go on, and you lay your head on the ground and close your eyes."
    },
    "wakeUpMessages": [
        "After uneasy dreams, you awake again.",
        "The sun's light greets you as your eyes flutter open.",
        "You rise, feeling somewhat refreshed."
    ],
    "responses": [
        "Very interesting!",
        "I didn't know that.",
        "Thank you.",
        "That sounds cool!",
        "Really?",
        "Tell me more.",
        "How fascinating!",
        "Could you explain further?",
        "That's a great point.",
        "I see what you mean."
    ],
    "rooms": {
        "startRoom": {
            "name": "The Dark Beginning",
            "description": "You are in a small, dimly lit room. There is a door to the north and a narrow passage to the east, and a spiral staircase that goes up to a loft space.",
            "exits": {
                "n": "seaView",
                "e": "mysticCave",
                "u": "loftLibrary"
            },
            "outside": false
        },
        "mysticCave": {
            "name": "Mystic Cave",
            "description": "This cave is filled with glowing crystals. A soft, eerie light fills the space. There is a tunnel that leads deeper into darkness to the east.",
            "exits": {
                "e": "ancientSanctum",
                "w": "startRoom"
            },
            "outside": false
        },
        "ancientSanctum": {
            "name": "Ancient Sanctum",
            "description": "You've discovered an ancient sanctum. Relics and tomes of forgotten lore are scattered about. A faint light comes from a passage leading west.",
            "exits": {
                "w": "mysticCave"
            },
            "outside": false
        },
        "loftLibrary": {
            "name": "Loft Library",
            "description": "A bright, cozy room filled with books. The walls are lined with shelves, and there's a comfortable looking chair by a small window to the sea. A spiral staircase leads back down.",
            "exits": {
                "d": "startRoom"
            },
            "outside": false
        },
        "seaView": {
            "name": "Sea View",
            "description": "You are on a cliff overlooking the sea. The view is breathtaking, with a path leading north along the cliff edge.",
            "exits": {
                "n": "cliffWalk",
                "s": "startRoom"
            },
            "outside": true,
            "exitErrors": {
                "e": "That way leads to a sheer plummet to the waves and rocks below.",
                "d": "You would surely not survive the fall.",
                "u": "There is nowhere to climb further upward.",
                "w": "The cliff face blocks your movement west."
            }
        },
        "cliffWalk": {
            "name": "Cliff Walk",
            "description": "The path along the cliff offers a stunning view of the ocean. A long set of stone steps carved near the cliff wall leads down.",
            "exits": {
                "d": "cliffStepsLanding",
                "s": "seaView"
            },
            "outside": true,
            "exitErrors": {
                "n": "The cliff path becomes too steep and narrow to climb further north.",
                "u": "Only the path allows a possible route further up, but it's too steep and narrow.",
                "w": "You are blocked by the cliff itself.",
                "e": "Eastward movement would take you right off the cliff. Fortunately, it seems like there are stone steps here that would carry you down."
            }
        },
        "cliffStepsLanding": {
            "name": "Cliff Steps Landing",
            "description": "You are halfway down the cliff, on an ornate stone landing. The air here hangs heavy with the scent of the sea. Around you, the cliff face is adorned with intricate carvings, depicting tales of myth and oceanic lore. The descending steps beckon you downward, spiraling into a shaded embrace below, where echoes of the ocean’s roar grow louder with each step. You may also escape upward to a cliff walkway.",
            "exits": {
                "u": "cliffWalk",
                "d": "stoneStepsBase"
            },
            "outside": true,
            "exitErrors": {
                "n": "The stairs only go up or down.",
                "e": "The stairs only go up or down.",
                "w": "The stairs only go up or down.",
                "s": "The stairs only go up or down."
            }
        },
        "stoneStepsBase": {
            "name": "Base of the Stone Steps",
            "description": "You are standing before the base of impressive stone steps that are carved right from the cliff wall, in a secluded nook of the world. The steps conclude at a rugged landing, and the looming cliffs that stretch skyward, their faces scarred by the elements yet standing staunch against time. To the north, through a natural archway formed by two embracing swaths of rock, lie sandy shores and the rumble of ocean waves.",
            "exits": {
                "n": "beach",
                "u": "cliffStepsLanding"
            },
            "outside": true,
            "exitErrors": {
                "e": "That only leads to the other side of this alcove, where you are blocked by tall jagged rocks.",
                "w": "That would make you collide with the cliff wall. Perhaps the upward stairs are more promising.",
                "s": "The southern direction here tapers into a wall of rocks. The open beach beckons to the north."
            }
        },
        "beach": {
            "name": "Sandy Beach",
            "description": "The beach extends before you, with the vast ocean lapping at your feet. The horizon is a vast canvas, painted with the hues of the deep blue and the fleeting gold of the sun’s tender rays. To your west, an enigmatic structure catches the eye-- a pergola, grand and weathered, its presence a silent testament to bygone eras of grandeur and mystery.",
            "exits": {
                "s": "stoneStepsBase",
                "w": "pergolaEntrance",
                "e": "impassableRocks"
            },
            "outside": true,
            "exitErrors": {
                "n": "There's only a vast expanse of sea to the north."
            }
        },
        "impassableRocks": {
            "name": "Impassable Rocks",
            "description": "The beach thins out into a jumble of impassable rocks. Eastward, the beach narrows sharply, giving way to a chaotic assembly of jagged rocks. These sentinels of stone bar the way, making further eastward movement impossible.",
            "exits": {
                "w": "beach"
            },
            "outside": true,
            "exitErrors": {
                "e": "The jagged rocks block your movement eastward.",
                "s": "You attempt to climb up some steep rocks that cover a dune, but you are forced back by the steepness.",
                "n": "The ocean blocks you from doing anything other than a brief wade."
            }
            
        },
        "pergolaEntrance": {
            "name": "Pergola Entrance",
            "description": "You stand before the entrance to a massive pergola. Its massive gates are swung open, as if inviting in wanderers and the winds alike. Vines, both lush and withering, crawl up its stony pillars, grappling with the ravages of time. The architectur-- a blend of forgotten artistry and the eternal will of nature-- stands proud yet vulnerable, offering shelter and whispers of secrets long held within its shadowed halls.",
            "exits": {
                "e": "beach",
                "w": "pergolaInterior"
            },
            "outside": true,
            "exitErrors": {
                "n": "The ocean laps at your feet in that direction.",
                "s": "The pergola becomes one with a wall of jagged rock in that direction."
            }
        },
        "pergolaInterior": {
            "name": "Pergola Interior",
            "description": "Stepping inside the pergola, you are enveloped in a realm that defies time. The interior is dominated by a massive, opulent bed, its linens mixed with large goblets, giving you the impression of a marriage bed of the gods. A lonely bookshelf stands watch, filled with tomes with spines weathered by salt, sand and wind.",
            "exits": {
                "e": "pergolaEntrance"
            },
            "outside": true
        }

    },
    "objects": [
    {
      "name": "ancient coin",
      "shortNames": ["coin"],
      "article": "an",
      "location": "Mystic Cave",
      "descriptionInitial": "An ancient coin lies half-buried in the dusty floor of the cave.",
      "description": "The ancient coin, though tarnished, gleams faintly in the light.",
      "descriptionInventory": "The small coin feels heavy and cold in your pocket.",
      "descriptionWeild": "",
      "descriptionEmbedded": false,
      "inventorySpace": 1,
      "carryable": true,
      "moved": false,
      "openable": false,
      "closable": false,
      "weildable": false,
      "translucent": false,
      "internalSpace": 0,
      "customErrors": {
        "open": "It's a coin, not a clamshell!",
        "close": "",
        "putInside": "",
        "take": ""
      },
      "scoreIncrease": 5
    },
    {
      "name": "rusty key",
      "shortNames": ["key"],
      "article": "a",
      "location": "Loft Library",
      "descriptionInitial": "A rusty key hangs from an old hook on the wall.",
      "description": "The key is ornate, suggesting it unlocks something valuable.",
      "descriptionInventory": "The rusty key jingles softly with every step you take.",
      "descriptionWeild": "",
      "descriptionEmbedded": false,
      "inventorySpace": 1,
      "carryable": true,
      "moved": false,
      "openable": false,
      "closable": false,
      "weildable": false,
      "translucent": false,
      "internalSpace": 0,
      "customErrors": {
        "open": "",
        "close": "",
        "putInside": "",
        "take": ""
      },
      "scoreIncrease": 0
    },
    {
        "name": "bed",
        "shortNames": ["bed"],
        "article": "a",
        "location": "Pergola Interior",
        "descriptionInitial": "A massive, opulent bed dominates the room.",
        "description": "The bed is adorned with luxurious linens, fit for royalty.",
        "descriptionInventory": "",
        "descriptionWeild": "",
        "descriptionEmbedded": true,
        "inventorySpace": 0,
        "carryable": false,
        "moved": false,
        "openable": false,
        "closable": false,
        "weildable": false,
        "translucent": false,
        "internalSpace": 0,
        "customErrors": {
            "open": "The bed is not something you can open.",
            "close": "The bed doesn't close.",
            "putInside": "There’s nowhere to put that in the bed.",
            "take": "The bed is far too heavy to move."
        },
        "scoreIncrease": 0
    },
    {
        "name": "bookshelf",
        "shortNames": ["shelves"],
        "article": "a",
        "location": "Pergola Interior",
        "descriptionInitial": "A lonely bookshelf stands against the wall, filled with weathered tomes.",
        "description": "The bookshelf is filled with ancient books, some of which are crumbling with age.",
        "descriptionInventory": "",
        "descriptionWeild": "",
        "descriptionEmbedded": true,
        "inventorySpace": 0,
        "carryable": false,
        "moved": false,
        "openable": false,
        "closable": false,
        "weildable": false,
        "translucent": false,
        "internalSpace": 0,
        "customErrors": {
            "open": "The bookshelf is not something you can open.",
            "close": "The bookshelf doesn’t close.",
            "putInside": "You can’t put that inside the bookshelf.",
            "take": "The bookshelf is far too heavy to move."
        },
        "scoreIncrease": 0
    },
    {
        "name": "ornate goblet",
        "shortNames": ["goblet"],
        "article": "an",
        "location": "Pergola Interior",
        "descriptionInitial": "An ornate goblet lies on the ground, glinting in the dim light.",
        "description": "The goblet is crafted from a heavy, tarnished metal, with intricate designs etched into its surface.",
        "descriptionInventory": "The ornate goblet feels substantial in your hand, its weight a testament to its craftsmanship.",
        "descriptionWeild": "",
        "descriptionEmbedded": false,
        "inventorySpace": 2,
        "carryable": true,
        "moved": false,
        "openable": false,
        "closable": false,
        "weildable": false,
        "translucent": false,
        "internalSpace": 1,
        "customErrors": {
            "open": "The goblet is already open.",
            "close": "The goblet doesn’t close.",
            "putInside": "You can only put liquid inside the goblet.",
            "take": ""
        },
        "scoreIncrease": 0
    },
    {
        "name": "jar of pesto",
        "shortNames": ["pesto", "jar"],
        "article": "a",
        "location": "Pergola Interior",
        "descriptionInitial": "A small jar of pesto sits quaintly on the bookshelf, its green contents vivid against the old wood.",
        "description": "The jar of pesto is sealed tight, promising a fresh taste of basil and pine nuts.",
        "descriptionInventory": "The jar feels cool and slightly gritty in your hand, the label worn but the seal intact.",
        "descriptionWeild": "Holding the jar, you feel oddly prepared for a culinary emergency.",
        "descriptionEmbedded": false,
        "inventorySpace": 1,
        "carryable": true,
        "openable": true,
        "closeable": true,
        "weildable": true,
        "translucent": false,
        "putInsideable": false,
        "insideCapacity": 0,
        "scoreValueWhenTaken": 5,
        "customErrors": {
            "open": "The jar's lid resists your efforts to twist it open.",
            "close": "The lid clicks back into place with a satisfying snap."
        }
    }
]
}